---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionCutback
source: html/50f4a92d-e0cf-d932-bf49-a7aefb6acf41.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionCutback Property

"Automatic Cutback for Beams and Braces"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionCutback { get; }
```